refactor: replace d2 with mermaid
